#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic.error_parsing_alerts will be created
  + resource "aws_sns_topic" "error_parsing_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "error-parsing-alerts-alarm"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + tags_all                    = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + tracing_config              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "./terraform.plan"

```

</details>

*Pushed by: @aribasadme, Action: `pull_request`*